In [1]:
import pandas as pd
# pandas is built on top of numpy, but recognizes the need for data analysts to handle mixed data types
# it is designed for relational tables

In [2]:
# when you have a pandas object with only one column -> Data Series. Commonly generated from a List.

my_series = pd.Series(["John Lenon","Paul McCartney","George Harrison","Ringo Starr","Jose Pereira"])

# a pandas series comes with an extra column for free!!!! -> index

In [3]:
display(my_series)

0         John Lenon
1     Paul McCartney
2    George Harrison
3        Ringo Starr
4       Jose Pereira
dtype: object

In [4]:
# you can get the values of a series back into a list
my_list = list(my_series)
my_list

['John Lenon',
 'Paul McCartney',
 'George Harrison',
 'Ringo Starr',
 'Jose Pereira']

In [5]:
#dictionaries lend themselves naturally to become series
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

pd.Series(population_dict)

# pandas dataframes were created to interact naturally with objects like lists, dictionaries, tuples (+-) 
# data series only have ONE column -> if you want more, lets go to dataframes

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [6]:
# a dataframe is a bunch of pandas series side by side
# or a bunch of dictionaries with shared keys

In [7]:
names = ["John Lenon","Paul McCartney","George Harrison","Ringo Starr","Jose Pereira"]
instruments = ["Vocals","Bass","Bass","Drums","Triangle"]
tenure = [9,12,12,8,1]
num_fans = [9000,2400,2000,1600,6]

In [8]:
pd.DataFrame([names, instruments,tenure,num_fans])

            0               1                2            3             4
0  John Lenon  Paul McCartney  George Harrison  Ringo Starr  Jose Pereira
1      Vocals            Bass             Bass        Drums      Triangle
2           9              12               12            8             1
3        9000            2400             2000         1600             6

In [9]:
# usually in data analysis we have each different object in each row and each different attribute of objects in the columns.
# Seems like a good use for the transpose function. Transpose rotates the table
import numpy as np

transposed = np.array([names, instruments,tenure,num_fans]).transpose()
display(transposed)

pd.DataFrame(transposed)

array([['John Lenon', 'Vocals', '9', '9000'],
       ['Paul McCartney', 'Bass', '12', '2400'],
       ['George Harrison', 'Bass', '12', '2000'],
       ['Ringo Starr', 'Drums', '8', '1600'],
       ['Jose Pereira', 'Triangle', '1', '6']], dtype='<U15')

                 0         1   2     3
0       John Lenon    Vocals   9  9000
1   Paul McCartney      Bass  12  2400
2  George Harrison      Bass  12  2000
3      Ringo Starr     Drums   8  1600
4     Jose Pereira  Triangle   1     6

In [10]:
#let's just add meaningful column names

beatles_df = pd.DataFrame(transposed, columns=['name','instrument','tenure','num_fans'])
beatles_df

              name instrument tenure num_fans
0       John Lenon     Vocals      9     9000
1   Paul McCartney       Bass     12     2400
2  George Harrison       Bass     12     2000
3      Ringo Starr      Drums      8     1600
4     Jose Pereira   Triangle      1        6

In [19]:
# we can look at this dataframe as a dictionary where each key correspondes to multiple values
# amazingly, dataframes are indexed both in the rows and in the columns!

#we can slice the dataframe by name
beatles_df[1:3] # row name 

#beatles_df[['instrument','num_fans']] #column name

#exception: a single column can be called without double bracket. It returns a Series
#beatles_df['instrument']


#or by location
#beatles_df.iloc[3:5]
#beatles_df.iloc[:,1:3]
#beatles_df.iloc[1:4,2:-1]

  tenure
1     12
2     12
3      8

In [18]:
#dataframes are mutable
beatles_df
#beatles_df.iloc[0,3]
#beatles_df.iloc[0,3] = 8000
#beatles_df

              name instrument tenure num_fans
0       John Lenon     Vocals      9     9000
1   Paul McCartney       Bass     12     2400
2  George Harrison       Bass     12     2000
3      Ringo Starr      Drums      8     1600
4     Jose Pereira   Triangle      1        6

In [21]:
#In fact they are too mutable! When you make changes to a slice of a dataframe, you are changing the original dataframe *even if you create a new object to store the slice*!!!

beatles_names = beatles_df['name']
beatles_names
beatles_names[4]='Frederico'
beatles_df

              name instrument tenure num_fans
0       John Lenon     Vocals      9     9000
1   Paul McCartney       Bass     12     2400
2  George Harrison       Bass     12     2000
3      Ringo Starr      Drums      8     1600
4        Frederico   Triangle      1        6

In [25]:
# to avoid this you should use the method .copy() in slices

beatles_names = beatles_df['name'].copy()
beatles_names
beatles_names[4]='Jose Pereira'
beatles_df

              name instrument tenure num_fans
0       John Lenon     Vocals      9     9000
1   Paul McCartney       Bass     12     2400
2  George Harrison       Bass     12     2000
3      Ringo Starr      Drums      8     1600
4        Frederico   Triangle      1        6

In [30]:
# you can change whole columns at a time:

beatles_df['tenure']
beatles_df['tenure'] = beatles_df['tenure'].astype(str)
beatles_df['tenure'] = beatles_df['tenure'].astype(int)
beatles_df['tenure']

0     9
1    12
2    12
3     8
4     1
Name: tenure, dtype: int64

In [31]:
# and create new columns all at once from other columns
beatles_df['avg_fans_year'] = beatles_df['num_fans']/beatles_df['tenure']
beatles_df

              name instrument  tenure  num_fans  avg_fans_year
0       John Lenon     Vocals       9      9000    1000.000000
1   Paul McCartney       Bass      12      2400     200.000000
2  George Harrison       Bass      12      2000     166.666667
3      Ringo Starr      Drums       8      1600     200.000000
4        Frederico   Triangle       1         6       6.000000

In [32]:
#you can also apply mathematical functions to entire columns at once
beatles_df['num_fans'].sum()

15006

In [ ]:
#advanced (for now)
#you can combine the information from two dataframes based on their values

baseline = pd.DataFrame([['Vocals',700],['Drums',150],['Piano',100],['Guitar',550],['Bass',180],['Triangle',10]],columns=['instrument played','avg num fans'])
display(baseline)
#NTS: show difference between display and print

# enriched = pd.merge(left = beatles_df,
#                     right = baseline,
#                     left_on = 'instrument',
#                     right_on = 'instrument played',
#                     how='inner'
#                     )  
# enriched

  instrument played  avg num fans
0            Vocals           700
1             Drums           150
2             Piano           100
3            Guitar           550
4              Bass           180
5          Triangle            10

              name instrument  ...  instrument played  avg num fans
0       John Lenon     Vocals  ...             Vocals           700
1   Paul McCartney       Bass  ...               Bass           180
2  George Harrison       Bass  ...               Bass           180
3      Ringo Starr      Drums  ...              Drums           150
4     Jose Pereira   Triangle  ...           Triangle            10

[5 rows x 7 columns]

In [ ]:
# you can compare columns, just like you can do operations between them
enriched['overacheived'] = enriched['avg_fans_year'] > enriched['avg num fans']
enriched

              name instrument  ...  avg num fans  overacheived
0       John Lenon     Vocals  ...           700          True
1   Paul McCartney       Bass  ...           180          True
2  George Harrison       Bass  ...           180         False
3      Ringo Starr      Drums  ...           150          True
4     Jose Pereira   Triangle  ...            10         False

[5 rows x 8 columns]

In [ ]:
# a column like this is called a boolean mask
enriched['overacheived']

0     True
1     True
2    False
3     True
4    False
Name: overacheived, dtype: bool

In [ ]:
# finally, you can filter based on values
only_overacheivers = enriched[enriched['overacheived']==True]
only_overacheivers

             name instrument  ...  avg num fans  overacheived
0      John Lenon     Vocals  ...           700          True
1  Paul McCartney       Bass  ...           180          True
3     Ringo Starr      Drums  ...           150          True

[3 rows x 8 columns]

In [ ]:
import pandas as pd

In [ ]:
# read data from a csv
# this csv is a "database" of housing prices

df = pd.read_csv("sample_data/california_housing_test.csv")
df

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

In [ ]:
df.to_csv("output_file.csv")#,index=False)